# Installation

In [1]:
#!pip install sqlalchemy psycopg2-binary

# Import

In [2]:
from sqlalchemy import create_engine
from sqlalchemy import text
import pandas as pd

# Connection Parameters

In [3]:
user = "postgres"
password = "admin"
host = "localhost"
port = "5432"
database = "northwind"

# Class: PSQL

In [4]:
class PSQL:

    #---Initialization---------------------------------------------------------------------
    def __init__(self):
        self.engine = None
        self.get_connection()

    #---Get Database Connection------------------------------------------------------------
    def get_connection(self):
        # PostgreSQL connection URL
        connection_url = f"postgresql+psycopg2://{user}:{password}@{host}:{port}/{database}"
        
        # Create SQLAlchemy engine
        engine = create_engine(connection_url)
        
        # Test connection
        try:
            with engine.connect() as connection:
                print("Connected successfully!")
        except Exception as e:
            print("Connection failed:", e)

        self.engine = engine

    #---Execute SQL Query------------------------------------------------------------------
    def query(self,sql, quiet=True):

        if str(sql).strip()=='':
            return None

        results =[]
        with self.engine.connect() as conn:
            result = conn.execute(sql)
            rows = result.fetchall()
    
        count=0
        for row in rows:
            if count<5 and not quiet:
                print(row)
                count += 1
            results.append(row)
        
        df = pd.DataFrame(results)
        df.index = df.index + 1
        print(f"Total Rows: {len(df)}")
        return df

In [5]:
a = text("")
str(a)==''

True

# Usage

### Initialization

In [6]:
psql=PSQL()

Connected successfully!

<hr style="border: 2px solid red;" />
<hr style="border: 2px solid blue;" />
<hr style="border: 2px solid green;" />

## Question 1
### Select all product names, unit price and the supplier region that don’t have suppliers from the USA **region**

In [7]:
sql1 = text("""
SELECT product_name, unit_price, region
FROM products
INNER JOIN suppliers
USING (supplier_id)
WHERE country != 'USA'
  AND region IS NOT NULL
""")

df=psql.query(sql1)
df

Total Rows: 14

                 product_name  unit_price    region
1              Queso Cabrales       21.00  Asturias
2   Queso Manchego La Pastora       38.00  Asturias
3                     Pavlova       17.45  Victoria
4                Alice Mutton       39.00  Victoria
5            Carnarvon Tigers       62.50  Victoria
6       Manjimup Dried Apples       53.00       NSW
7                    Filo Mix        7.00       NSW
8               Perth Pasties       32.80       NSW
9                   Tourtière        7.45    Québec
10               Pâté chinois       24.00    Québec
11             Sirop d'érable       28.50    Québec
12             Tarte au sucre       49.30    Québec
13               Vegie-spread       43.90  Victoria
14              Outback Lager       15.00  Victoria

<hr style="border: 2px solid red;" />
<hr style="border: 2px solid blue;" />
<hr style="border: 2px solid green;" />

## Question 2 (semi-join) (using EXISTS)
### Get all customer names that live in the same city as the employees.

In [8]:
sql2 = text("""
SELECT contact_name, city
FROM customers
WHERE city in (
        SELECT DISTINCT city
        FROM employees
    )
""")

df=psql.query(sql2)
df

Total Rows: 8

        contact_name      city
1       Thomas Hardy    London
2  Victoria Ashworth    London
3    Elizabeth Brown    London
4          Ann Devon    London
5     Simon Crowther    London
6         Hari Kumar    London
7     Helvetius Nagy  Kirkland
8     Karl Jablonski   Seattle

<hr style="border: 2px solid red;" />
<hr style="border: 2px solid blue;" />
<hr style="border: 2px solid green;" />

## Question 3
### - Get the number of customers living in each country Where the number of residents is greater than 10 
### - and sort the countries in descending order.

In [9]:
sql3 = text("""
SELECT country, COUNT(*)
FROM customers
GROUP BY country
HAVING COUNT(*) > 10
ORDER BY country DESC
""")
df=psql.query(sql3)
df

Total Rows: 3

   country  count
1      USA     13
2  Germany     11
3   France     11

<hr style="border: 2px solid red;" />
<hr style="border: 2px solid blue;" />
<hr style="border: 2px solid green;" />

## Question 4
### - Display the Customer Name (ContactName) and the number of orders ordered by this customer, 
### - for customers living in the UK. 
### - Arrange the result based on the number of orders from the greatest to the lowest.

In [10]:
sql4 = text("""
SELECT contact_name, COUNT(order_id) AS no_of_orders
FROM customers
INNER JOIN orders
USING (customer_id)
WHERE country = 'UK'
GROUP BY contact_name
ORDER BY COUNT(*) DESC
""")

df=psql.query(sql4)
df

Total Rows: 7

        contact_name  no_of_orders
1       Thomas Hardy            13
2  Victoria Ashworth            10
3      Helen Bennett            10
4         Hari Kumar             9
5          Ann Devon             8
6     Simon Crowther             3
7    Elizabeth Brown             3

<hr style="border: 2px solid red;" />
<hr style="border: 2px solid blue;" />
<hr style="border: 2px solid green;" />

## Question 5
### - For each of the following countries (USA, Italy and France), display the country name 
### - in addition to the number of suppliers living in this country and having a fax number. 
### - Sort the result by the country name in a descending order and give a meaningful name(s) for any un-named column(s).

In [11]:
sql5 = text("""
SELECT country, COUNT(*)
FROM suppliers
WHERE fax IS NOT NULL
  AND country in ('USA', 'France', 'Italy')
GROUP BY country
ORDER BY country DESC
""")
df=psql.query(sql5)
df

Total Rows: 3

  country  count
1     USA      2
2   Italy      2
3  France      2

<hr style="border: 2px solid red;" />
<hr style="border: 2px solid blue;" />
<hr style="border: 2px solid green;" />

## Question 6
### - Display the first name, job title and the city of all employees not working as Sales Managers 
### - and living in the same city as the employee with first name: Michael. 
### - Sort the result by the first name of the employees in an ascending order.

In [12]:
sql6 = text("""
SELECT first_name, title, city
FROM employees
WHERE title != 'Sales Manager'
  AND city IN (
      SELECT DISTINCT city 
      FROM employees
      WHERE first_name = 'Michael'
    )
ORDER BY first_name ASC
""")

df=psql.query(sql6)
df

Total Rows: 3

  first_name                 title    city
1       Anne  Sales Representative  London
2    Michael  Sales Representative  London
3     Robert  Sales Representative  London

<hr style="border: 2px solid red;" />
<hr style="border: 2px solid blue;" />
<hr style="border: 2px solid green;" />

## Qestion 7
### -  Display the first name, job title and the country of all employees working as Sales Representatives 
### - and living in the same country as the manager 
### - (Note: the manager is the person that doesn’t report to anyone). 
### - Sort the result by the first name of the employees in a descending order

In [13]:
sql7=text("""
SELECT first_name, title, country
FROM employees
WHERE title = 'Sales Representative'
  AND country in (
        SELECT DISTINCT country
        FROM employees
        WHERE reports_to IS NULL
  )
ORDER BY first_name DESC
""")

df=psql.query(sql7)
df

Total Rows: 3

  first_name                 title country
1      Nancy  Sales Representative     USA
2   Margaret  Sales Representative     USA
3      Janet  Sales Representative     USA

<hr style="border: 2px solid red;" />
<hr style="border: 2px solid blue;" />
<hr style="border: 2px solid green;" />

## Question 8
### -- Display the first name, address and the hire date of all employees having an address containing 2 and 
### -- who were hired before the employee with first name: Steven. 
### -- Sort the result by the first name of the employees in an ascending order.

In [14]:
sql8 = text("""
SELECT first_name, address, hire_date
FROM employees
WHERE address like '%2%'
  AND hire_date < (
        SELECT DISTINCT hire_date
        FROM employees
        WHERE first_name = 'Steven'
  )
ORDER BY first_name ASC
""")

df=psql.query(sql8)
df

Total Rows: 2

  first_name                      address   hire_date
1      Janet           722 Moss Bay Blvd.  1992-04-01
2      Nancy  507 - 20th Ave. E.\nApt. 2A  1992-05-01

<hr style="border: 2px solid red;" />
<hr style="border: 2px solid blue;" />
<hr style="border: 2px solid green;" />

## Question 9 (semi-join) (using IN)
### - Display the first name, country and the birth date of all employees who were born before 1958 
### - and are working in the same country as the employee with first name: Laura. 
### - Sort the result by the first name of the employees in an ascending order.

In [15]:
sql9 = text("""
SELECT first_name, country, birth_date
FROM employees
--WHERE EXTRACT(YEAR FROM birth_date) < 1958
WHERE birth_date < '1958-01-01'
  AND country in (
      SELECT country
      FROM employees
      WHERE first_name = 'Laura'
  )
ORDER BY first_name ASC
""")

df=psql.query(sql9)
df

Total Rows: 3

  first_name country  birth_date
1     Andrew     USA  1952-02-19
2   Margaret     USA  1937-09-19
3      Nancy     USA  1948-12-08

<hr style="border: 2px solid red;" />
<hr style="border: 2px solid blue;" />
<hr style="border: 2px solid green;" />

## Question 10
### - For each displayed country name, show how many products were supplied by suppliers who have got a fax number. 
### - Restrict the result for those countries having less than five supplied products. 
### - Label any un-named column(s) by a meaningful name(s).

In [16]:
sql10 = text("""
SELECT country, COUNT(*) AS no_of_orders
FROM suppliers
INNER JOIN products
USING (supplier_id)
WHERE fax IS NOT NULL
GROUP BY country
HAVING COUNT(*) < 5
""")

df=psql.query(sql10)
df

Total Rows: 6

       country  no_of_orders
1       Sweden             2
2       France             4
3  Netherlands             2
4      Germany             1
5      Denmark             2
6       Canada             2

<hr style="border: 2px solid red;" />
<hr style="border: 2px solid blue;" />
<hr style="border: 2px solid green;" />
<hr style="border: 2px solid red;" />
<hr style="border: 2px solid blue;" />
<hr style="border: 2px solid green;" />
<hr style="border: 2px solid red;" />
<hr style="border: 2px solid blue;" />
<hr style="border: 2px solid green;" />

In [17]:
Q1 = text("""
SELECT product_id, product_name
FROM products
WHERE discontinued = 0
""")

df=psql.query(Q1)
df

Total Rows: 67

    product_id                     product_name
1            3                    Aniseed Syrup
2            4     Chef Anton's Cajun Seasoning
3            6     Grandma's Boysenberry Spread
4            7  Uncle Bob's Organic Dried Pears
5            8       Northwoods Cranberry Sauce
..         ...                              ...
63          73                       Röd Kaviar
64          74                    Longlife Tofu
65          75             Rhönbräu Klosterbier
66          76                     Lakkalikööri
67          77  Original Frankfurter grüne Soße

[67 rows x 2 columns]

In [18]:
Q2 = text("""
SELECT product_name, unit_price
FROM products
WHERE unit_price > 15 AND unit_price < 25
  AND discontinued = 0
""")

df=psql.query(Q2)
df

Total Rows: 18

                        product_name  unit_price
1       Chef Anton's Cajun Seasoning       22.00
2                     Queso Cabrales       21.00
3                               Tofu       23.25
4                            Pavlova       17.45
5                Gustaf's Knäckebröd       21.00
6                     Steeleye Stout       18.00
7                        Inlagd Sill       19.00
8                   Chartreuse verte       18.00
9                   Boston Crab Meat       18.40
10                      Gula Malacca       19.45
11                          Maxilaku       20.00
12                  Valkoinen suklaa       16.25
13                      Pâté chinois       24.00
14                    Ravioli Angelo       19.50
15  Louisiana Fiery Hot Pepper Sauce       21.05
16         Louisiana Hot Spiced Okra       17.00
17                       Flotemysost       21.50
18                      Lakkalikööri       18.00

In [19]:
Q3 = text("""
SELECT product_name, units_on_order, units_in_stock
FROM products
WHERE units_in_stock < units_on_order
  AND discontinued = 0
""")

df=psql.query(Q3)
df

Total Rows: 13

                 product_name  units_on_order  units_in_stock
1               Aniseed Syrup              70              13
2              Queso Cabrales              30              22
3         Sir Rodney's Scones              40               3
4           Gorgonzola Telino              70               0
5          Mascarpone Fabioli              40               9
6                  Gravad lax              50              11
7                 Rogede sild              70               5
8                   Chocolade              70              15
9                    Maxilaku              60              10
10  Wimmers gute Semmelknödel              80              22
11  Louisiana Hot Spiced Okra             100               4
12        Scottish Longbreads              10               6
13              Longlife Tofu              20               4

In [20]:
Q4 = text("""
SELECT COUNT(*)
FROM employees
WHERE EXTRACT(YEAR FROM age(CURRENT_DATE, hire_date)) >  5
""")

df=psql.query(Q4)
df

Total Rows: 1

   count
1      9

In [21]:
Q4a = text("""
SELECT hire_date, first_name || ' ' || last_name AS full_name
FROM employees
ORDER BY hire_date
-- WHERE EXTRACT(YEAR FROM age(CURRENT_DATE, hire_date)) >  5

""")

df=psql.query(Q4a)
df

Total Rows: 9

    hire_date         full_name
1  1992-04-01   Janet Leverling
2  1992-05-01     Nancy Davolio
3  1992-08-14     Andrew Fuller
4  1993-05-03  Margaret Peacock
5  1993-10-17   Steven Buchanan
6  1993-10-17    Michael Suyama
7  1994-01-02       Robert King
8  1994-03-05    Laura Callahan
9  1994-11-15    Anne Dodsworth

In [22]:
Q5 = text("""
SELECT first_name || ' ' || last_name AS full_name,
       hire_date
FROM employees
ORDER BY hire_date ASC
LIMIT 1
""")

df=psql.query(Q5)
df

Total Rows: 1

         full_name   hire_date
1  Janet Leverling  1992-04-01

In [23]:
Q6 = text("""
SELECT contact_name, COUNT(*)
FROM customers
INNER JOIN orders
USING (customer_id)
WHERE country = 'USA'
GROUP by contact_name
HAVING COUNT(*) > 5
""")

df=psql.query(Q6)
df

Total Rows: 7

         contact_name  count
1      Jose Pavarotti     31
2  Art Braunschweiger      9
3         Fran Wilson      8
4       Howard Snyder     11
5      Karl Jablonski     14
6        Paula Wilson     18
7       Rene Phillips     10

In [24]:
Q7 = text("""
SELECT product_name, sum(quantity)
FROM products
INNER JOIN order_details
USING (product_id)
WHERE products.unit_price > 30
GROUP BY product_name
HAVING SUM(quantity) > 1000 AND SUM(quantity) < 1500
""")

df=psql.query(Q7)
df

Total Rows: 3

             product_name   sum
1          Tarte au sucre  1083
2  Gnocchi di nonna Alice  1263
3    Raclette Courdavault  1496

In [25]:
df = pd.DataFrame([
    [1, 2],
    [3, 4]
])

In [26]:
df.first(1)

/var/folders/h8/gz3l0j7d7tx4xdw6bdg0w41r0000gn/T/ipykernel_99802/2022957179.py:1: FutureWarning: first is deprecated and will be removed in a future version. Please create a mask and filter using `.loc` instead
  df.first(1)

TypeError: 'first' only supports a DatetimeIndex index

In [ ]:
Q